### Resolver sistemas de ecuaciones con Numpy
import numpy as np

# 2x +3y +4z =  20
# 3x -5y  -z = -10
# -x +2y -3z = -6

#       2  3  4 
# A =   3 -5 -1
#      -1  2 -3

A = np.array([[ 2,  3,  4],
              [ 3, -5, -1],
              [-1,  2, -3]])

#      20
# B = -10
#     - 6

B = np.array([20, -10, -6])

X = np.linalg.solve(A,B)

print("Solución 1 (x,y,z): ", X)

#   5x_1 + 4x_2 - 1x_3 + 2x_4 - 9x_5 =   29
#   4x_1 + 3x_2 - 5x_3 - 5x_4 + 4x_5 =  -65
#   6x_1 - 6x_2 - 3x_3 - 9x_4 + 4x_5 = -113
# - 8x_1 + 8x_2 + 5x_3 - 3x_4 - 6x_5 =   35
# - 3x_1 - 7x_2 + 2x_3 - 5x_4 + 4x_5 =  -50

#      5  4 -1  2 -9
#      4  3 -5 -5  4
# A =  6 -6 -3 -9  4
#     -8  8  5 -3 -6
#     -3 -7  2 -5  4

A = np.array([[ 5,  4, -1,  2, -9],
              [ 4,  3, -5, -5,  4],
              [ 6, -6, -3, -9,  4],
              [-8,  8,  5, -3, -6],
              [-3, -7,  2, -5,  4]])

#       29
#      -65
# B = -113
#       35
#      -50

B = np.array([29, -65, -113, 35, -50])

X = np.linalg.solve(A,B)

print("Solución 2 (x1, x2, x3, x4, x5):", X)